adafruit/tinyuf2/ports/mimxrt10xx/boards/metro_m7_1011/flash_config.c
/*
 * Copyright 2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "flexspi_nor_flash.h"
#include "fsl_flexspi_nor_boot.h"
#include "boards.h"

// Config for W25Q64JVSIQ with QSPI routed.
__attribute__((section(".boot_hdr.conf")))
const flexspi_nor_config_t qspiflash_config = {
    .pageSize           = 256u,
    .sectorSize         = 4u * 1024u,
    .ipcmdSerialClkFreq = kFlexSpiSerialClk_30MHz,
    .blockSize          = 64u * 1024u,
    .isUniformBlockSize = false,
    .memConfig =
    {
        .tag              = FLEXSPI_CFG_BLK_TAG,
        .version          = FLEXSPI_CFG_BLK_VERSION,
        .readSampleClkSrc = kFlexSPIReadSampleClk_LoopbackFromSckPad,
        .csHoldTime       = 3u,
        .csSetupTime      = 3u,

        .busyOffset = 0u, // Status bit 0 indicates busy.
        .busyBitPolarity = 0u, // Busy when the bit is 1.

        .deviceModeCfgEnable = 1u,
        .deviceModeType = kDeviceConfigCmdType_QuadEnable,
        .deviceModeSeq = {
          .seqId = 4u,
          .seqNum = 1u,
        },
        .deviceModeArg = 0x0200,
        .configCmdEnable = 1u,
        .configModeType[0] = kDeviceConfigCmdType_Generic,
        .configCmdSeqs[0] = {
          .seqId = 2u,
          .seqNum = 1u,
        },
        .deviceType    = kFlexSpiDeviceType_SerialNOR,
        .sflashPadType = kSerialFlash_4Pads,
        .serialClkFreq = kFlexSpiSerialClk_100MHz,
        .sflashA1Size  = FLASH_SIZE,
        .lookupTable =
        {
            // FLEXSPI_LUT_SEQ(cmd0, pad0, op0, cmd1, pad1, op1)
            // The high 16 bits is command 1 and the low are command 0.
            // Within a command, the top 6 bits are the opcode, the next two are the number
            // of pads and then last byte is the operand. The operand's meaning changes
            // per opcode.

            // Indices with ROM should always have the same function because the ROM
            // bootloader uses it.

            // 0: ROM: Read
            // Quad version
            SEQUENCE(FLEXSPI_LUT_SEQ(CMD_SDR,   FLEXSPI_1PAD, 0xEB /* command code */,
                                     RADDR_SDR, FLEXSPI_4PAD, 24 /* bits to transmit */),
                     FLEXSPI_LUT_SEQ(DUMMY_SDR, FLEXSPI_4PAD, 6 /* 6 dummy cycles, 2 for M7-0 and 4 dummy */,
                                     READ_SDR,  FLEXSPI_4PAD, 0x04),
            // Single fast read version, good for debugging.
            // FLEXSPI_LUT_SEQ(CMD_SDR,   FLEXSPI_1PAD, 0x0B /* command code */,
            //                 RADDR_SDR, FLEXSPI_1PAD, 24  /* bits to transmit */),
            // FLEXSPI_LUT_SEQ(DUMMY_SDR, FLEXSPI_1PAD, 8 /* 8 dummy clocks */,
            //                 READ_SDR,  FLEXSPI_1PAD, 0x04),
                     TWO_EMPTY_STEPS,
                     TWO_EMPTY_STEPS),

            // 1: Read Status
            SEQUENCE(FLEXSPI_LUT_SEQ(CMD_SDR,  FLEXSPI_1PAD, 0x05  /* command code */,
                                     READ_SDR, FLEXSPI_1PAD, 0x01),
                     TWO_EMPTY_STEPS,
                     TWO_EMPTY_STEPS,
                     TWO_EMPTY_STEPS),

            // 2: Read Status XPI ( DPI/QPI/OPI) i.e QE bit
            SEQUENCE(FLEXSPI_LUT_SEQ(CMD_SDR,  FLEXSPI_1PAD, 0x35 /* command code */,
                                     READ_SDR, FLEXSPI_1PAD, 1),
                     TWO_EMPTY_STEPS,
                     TWO_EMPTY_STEPS,
                     TWO_EMPTY_STEPS),

            // 3: Write Enable
            SEQUENCE(FLEXSPI_LUT_SEQ(CMD_SDR, FLEXSPI_1PAD, 0x06  /* command code */,
                                     STOP,    FLEXSPI_1PAD, 0x00),
                     TWO_EMPTY_STEPS,
                     TWO_EMPTY_STEPS,
                     TWO_EMPTY_STEPS),

            // 4: Write Quad enabled i.e Write Status1 & Status2
            SEQUENCE(FLEXSPI_LUT_SEQ(CMD_SDR,   FLEXSPI_1PAD, 0x01  /* command code */,
                                     WRITE_SDR, FLEXSPI_1PAD, 0x02),
                     TWO_EMPTY_STEPS,
                     TWO_EMPTY_STEPS,
                     TWO_EMPTY_STEPS),

            // 5: ROM: Erase Sector
            SEQUENCE(FLEXSPI_LUT_SEQ(CMD_SDR,   FLEXSPI_1PAD, 0x20 /* command code */,
                                     RADDR_SDR, FLEXSPI_1PAD, 24 /* bits to transmit */),
                     TWO_EMPTY_STEPS,
                     TWO_EMPTY_STEPS,
                     TWO_EMPTY_STEPS),

            // 6: Empty
            EMPTY_SEQUENCE,

            // 7: Empty
            EMPTY_SEQUENCE,

            // 8: Block Erase
            SEQUENCE(FLEXSPI_LUT_SEQ(CMD_SDR,   FLEXSPI_1PAD, 0xD8  /* command code */,
                                     RADDR_SDR, FLEXSPI_1PAD, 24 /* bits to transmit */),
                     TWO_EMPTY_STEPS,
                     TWO_EMPTY_STEPS,
                     TWO_EMPTY_STEPS),

            // 9: ROM: Page program single mode
            SEQUENCE(FLEXSPI_LUT_SEQ(CMD_SDR,   FLEXSPI_1PAD, 0x02  /* command code */,
                                     RADDR_SDR, FLEXSPI_1PAD, 24 /* bits to transmit */),

                     FLEXSPI_LUT_SEQ(WRITE_SDR, FLEXSPI_1PAD, 0x04  /* data out */,
                                     STOP,      FLEXSPI_1PAD, 0),
                     TWO_EMPTY_STEPS,
                     TWO_EMPTY_STEPS),

            // 10: Empty Page program (Quad mode) candidate
            EMPTY_SEQUENCE,

            // 11: ROM: Chip erase
            SEQUENCE(FLEXSPI_LUT_SEQ(CMD_SDR, FLEXSPI_1PAD, 0x60  /* command code */,
                                     STOP,    FLEXSPI_1PAD, 0),
                     TWO_EMPTY_STEPS,
                     TWO_EMPTY_STEPS,
                     TWO_EMPTY_STEPS),

            // 12: Empty
            EMPTY_SEQUENCE,

            // 13: ROM: Read SFDP
            EMPTY_SEQUENCE,

            // 14: ROM: Restore no cmd
            EMPTY_SEQUENCE,

            // 15: ROM: Dummy
            EMPTY_SEQUENCE
        },
    },
};
